Revit 2027 API
ParameterTypeId.StructuralConnectionApprovalStatus Property
 "Approval Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionApprovalStatus { get; }
Public Shared ReadOnly Property StructuralConnectionApprovalStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionApprovalStatus {
	ForgeTypeId^ get ();
}
static member StructuralConnectionApprovalStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace